code/openfoam/tutorials/incompressibleFluid/impeller/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            solidBody;

    libs            ("libpointMeshMovers.so");

    cellZone        rotating;

    solidBodyMotionFunction
    {
        type          rotatingMotion;

        origin        (0 0 0);
        axis          (1 0 0);

        omega         60 [rpm];
    }
}


// ************************************************************************* //
